"""
全局配置文件
集中管理 SEED 数据集元数据、采样率、通道拓扑与常量参数，避免硬编码散落。
"""

# 基础采样参数
FS = 200.0               # 采样率 (Hz)
WINDOW_SEC = 400.0        # 分段处理窗长 (秒)
OUTLIER_THRESHOLD = 130  # 超幅伪迹物理截断阈值 (μV)

# SEED 62导联标准顺序 (10-20系统)
CH_NAMES = [
    'FP1', 'FPZ', 'FP2', 'AF3', 'AF4', 'F7', 'F5', 'F3', 'F1', 'FZ', 'F2', 'F4', 'F6', 'F8',
    'FT7', 'FC5', 'FC3', 'FC1', 'FCZ', 'FC2', 'FC4', 'FC6', 'FT8', 'T7', 'C5', 'C3', 'C1',
    'CZ', 'C2', 'C4', 'C6', 'T8', 'TP7', 'CP5', 'CP3', 'CP1', 'CPZ', 'CP2', 'CP4', 'CP6',
    'TP8', 'P7', 'P5', 'P3', 'P1', 'PZ', 'P2', 'P4', 'P6', 'P8', 'PO7', 'PO5', 'PO3', 'POZ',
    'PO4', 'PO6', 'PO8', 'CB1', 'O1', 'OZ', 'O2', 'CB2'
]
# // 全局定义少导联目标拓扑，确保落盘时元数据可见
TARGET_NODES = ['FP1', 'FP2', 'F7', 'F3', 'FZ', 'F4', 'F8', 'T7', 
                'C3', 'CZ', 'C4', 'T8', 'PZ', 'O1', 'OZ', 'O2']
